
public class Main {

	public static void main(String[] args) {
		
		/*
		 * 우리 학원 선생님이 강의를 매우 못하여,
		 * 학원생들의 누적되었던 '화'들이  
		 * 학원에 고스란히 전해졌나보다.
		 * 
		 * 다수결 설문조사로 인해 선생님은 계약 종료된 것 같고,
		 * 새로운 선생님을 구할 때까지
		 * 일주일 간 휴강이라는 통보를 받았다.
		 * 원래라면 학원에 있을 시간이지만,
		 * 현재 집에서 정보처리기사 필기 공부 중이다.
		 * 
		 * 안타깝지만, 나 또한 선생님을 보며 굉장히 답답했기 때문에
		 * 쳐낼 땐 확 쳐내는 게 맞는 것 같다.
		 * 
		 * 
		 * 정보처리기사가 처음엔 어려운 것 같은데
		 * 그래도 눈에 익으니 답이 쏙쏙 보인다.
		 * 
		 * 오히려 걱정인건 백준 알고리즘 문제다.
		 * 
		 * 만약 한 문제를 풀 때,
		 * 어떤 방향으로 풀어야하는지는 알겠는데,
		 * 손이 자동으로 파파박하질 않는다.
		 * 
		 * 참 이게 한 끗 차이인 것 같은데,
		 * 보면 딱 딱 나오게 공부해야겠다.
		 * 
		 * 토비의 스프링은 엄두가 잘 안나지만
		 * 그래도 읽으면서 최대한 이해하려 노력중이다.
		 * 
		 * 근데 읽다보니 또 자바 언어가 부족한 것 같아,
		 * 남궁성님의 자바 강의를 다시 보고 있다.
		 * 
		 * 걱정이 많다.
		 * 뭐 근데 원래 모든 업종, 일에는 걱정이 따르니까~
		 * 정진할 뿐이다.
		 *  
		 * 이상 최정원 파이팅!
		 * 
		 */
	}

}
